Revit 2027 API
WorksetTable.GetActiveWorksetId Method
 Returns the active workset's WorksetId.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public WorksetId GetActiveWorksetId()
Public Function GetActiveWorksetId As WorksetId
public:
WorksetId^ GetActiveWorksetId()
member GetActiveWorksetId : unit -> WorksetId
Return Value
WorksetId
 WorksetId of the active workset.
Example
public Workset GetActiveWorkset(Document doc)
{
    // Get the workset table from the document
    WorksetTable worksetTable = doc.GetWorksetTable();
    // Get the Id of the active workset
    WorksetId activeId = worksetTable.GetActiveWorksetId();
    // Find the workset with that Id
    Workset workset = worksetTable.GetWorkset(activeId);
    return workset;
}
See Also
Reference
WorksetTable Class
Autodesk.Revit.DB Namespace